app/controllers/homes_controller.rb

SELECT "posts".* FROM "posts"
---
  def read
    @posts = Post.all